lvx/base/Documents/бит_му_НачислениеАмортизацииНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_НачислениеАмортизацииНМА</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>InformationRegister.бит_му_СобытияНМА</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>InformationRegister.бит_му_ПараметрыНМА</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НематериальныеАктивы</Name>
					<Comment>Нематериальные активы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НематериальныйАктив</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодНачисленияАмортизации</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизацииНМА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНачисленияАмортизации</Name>
							<Comment>Счет начисления амортизации</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизации</Name>
							<Comment>Сумма амортизации (МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Comment>Первоначальная стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленнаяАмортизация</Name>
							<Comment>Начисленная амортизация</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбесценения</Name>
							<Comment>Сумма обесценения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛиквидационнаяСтоимость</Name>
							<Comment>Ликвидационная стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентУскорения</Name>
							<Comment>Коэффициент ускорения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииТекущий</Name>
							<Comment>Объем продукции (работ) в натуральных ед.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииОстаточный</Name>
							<Comment>Объем продукции (работ) в натуральных ед. остаточный</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточныйСрокАмортизации</Name>
							<Comment>Остаточный срок амортизации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияРасходовПоАмортизации</Name>
							<Comment>Способ отражения расходов по амортизации</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_му_СпособыОтраженияРасходовПоАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/AccountingRegisters/бит_Дополнительный_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>бит_Дополнительный_2</Name>
			<Comment>(БИТ)</Comment>
			<ChartOfAccounts>ChartOfAccounts.бит_Дополнительный_2</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.бит_Дополнительный_2.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.бит_Дополнительный_2.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.бит_Дополнительный_2.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.бит_Дополнительный_2.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.бит_Дополнительный_2.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.бит_Дополнительный_2.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.бит_Дополнительный_2.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаМУ</Name>
					<Comment>Сумма в валюте международного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.бит_Дополнительный_2.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроводки</Name>
					<Comment>Вид проводки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_КонтрольПериодов_ВидыПроводок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормирования</Name>
					<Comment>Дата формирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроводки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПроводок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемаяПроводка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_му_СобытияНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_СобытияНМА</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Comment>Нематериальный актив</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Comment>Событие</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_СобытияНМА</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_му_СобытияНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_СобытияНМА</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФормированиеРезерва</Name>
					<Comment>Формирование резерва</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбесценения</Name>
					<Comment>Возврат обесценения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Модернизация</Name>
					<Comment>Модернизация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дооценка</Name>
					<Comment>Дооценка ОС при переоценки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уценка</Name>
					<Comment>Уценка ОС при переоценки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
					<Comment>Перевод в предназначенные для продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выбытие</Name>
					<Comment>Выбытие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Продажа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизации</Name>
					<Comment>Начисление амортизации</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Documents/бит_му_НачислениеАмортизацииНМА/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мВалютаМеждУчета Экспорт; // Хранит валюту международного учета

Перем мКоличествоСубконтоМУ Экспорт; // Хранит количество субконто международного учета в документа.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Переменная, хранящее значение структуры шапки документа.
	Перем СтруктураШапкиДокумента;
	

	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Получим курсы валют, неоходимые для выполнения пересчетов
	ВидыКурсов = Новый Структура("Упр,Регл,МУ, Документ");
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	СтрКурсов = СтруктураКурсыВалют.МУ;
	мВалютаМеждУчета = СтрКурсов.Валюта;
	Если НЕ ЗначениеЗаполнено(мВалютаМеждУчета) Тогда
		
		ТекстСообщения = НСтр("ru = 'Для организации ""%1"" не указана валюта международного учета.'; 
		                      |en = 'The organization ""%1"" does not have an international accounting currency.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтруктураШапкиДокумента.Организация);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	
	КонецЕсли; 
	
	// Получим исторические(на дату принятия к учету) курсы валют по каждому НМА.
	МассивНМА = НематериальныеАктивы.ВыгрузитьКолонку("НематериальныйАктив");
	МассивНМА = бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивНМА);
	ИсторическиеКурсы = ИсторическиеКурсыВалют(СтруктураШапкиДокумента, МассивНМА, КонецМесяца(СтруктураШапкиДокумента.Дата), СтруктураКурсыВалют);

	// Поиск уже выполненных начислений амортизации.
	НайтиЗадвоенныеНачисления(Отказ,Заголовок);
	
	СтруктураТаблиц = ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента);
	
	ПроверитьЗаполнениеТаблицДокумента(СтруктураТаблиц,СтруктураШапкиДокумента,Отказ,Заголовок);
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,СтруктураТаблиц, СтруктураКурсыВалют, ИсторическиеКурсы, Отказ, Заголовок);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьШапкуДокумента();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнитьШапкуДокумента(ОбъектКопирования);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СтруктураНеДублирующихсяПолей = Новый Структура;
	СтруктураНеДублирующихсяПолей.Вставить("НематериальныйАктив");
	
	// Проверим наличие дублей в табличной части "НематериальныеАктивы".
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект
																	 ,"НематериальныеАктивы"
																	 ,СтруктураНеДублирующихсяПолей
																	 ,Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция готовит таблицы документа для проведения.
// 
// Возвращаемое значение:
//   ТаблицаБДДС   - ТаблицаЗначений.
// 
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента) Экспорт
	
	// Сформируем структуру параметров для получения таблицы параметров.
	ПараметрыВНА = Новый Массив;
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.СчетУчета_НМА);
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.СчетСниженияСтоимости_НМА);
	
	МассивВНА = НематериальныеАктивы.ВыгрузитьКолонку("НематериальныйАктив");
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.бит_ВидыСубконтоДополнительные_2.НематериальныеАктивы);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	СтруктураПараметров.Вставить("НематериальныйАктив", МассивВНА);
	СтруктураПараметров.Вставить("МоментВремени"   , КонецМесяца(СтруктураШапкиДокумента.Дата));
	СтруктураПараметров.Вставить("ПараметрыВНА"	   , ПараметрыВНА);
	
	// Получим таблицу параметров
	ТаблицаПараметров = бит_му_ВНА.ДанныеПараметровВНА(СтруктураПараметров, "ТаблицаЗначений");

	МассивСчетовУчета = ТаблицаПараметров.ВыгрузитьКолонку("СчетУчета_НМА");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСчетовУчета);
	
	МассивСчетовСнижения = ТаблицаПараметров.ВыгрузитьКолонку("СчетСниженияСтоимости_НМА");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСчетовСнижения);

	// Получим таблицу данных
	Запрос = Новый Запрос;
	
    Запрос.УстановитьПараметр("Ссылка"				, Ссылка);
	Запрос.УстановитьПараметр("МоментВремени"   	, КонецМесяца(СтруктураШапкиДокумента.Дата));
	Запрос.УстановитьПараметр("Организация"     	, СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("МассивСчетовУчета"	, МассивСчетовУчета);
	Запрос.УстановитьПараметр("МассивСчетовСнижения", МассивСчетовСнижения);
	Запрос.УстановитьПараметр("МассивНМА"			, МассивВНА);
	Запрос.УстановитьПараметр("МассивСубконто"		, МассивСубконто);
	Запрос.УстановитьПараметр("СостояниеПринято"							, Перечисления.бит_му_СостоянияНМА.ПринятоКУчету);	
	Запрос.УстановитьПараметр("ПараметрНачислятьАмортизацию"				, ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.НачислятьАмортизацию_НМА);
	Запрос.УстановитьПараметр("ПараметрНачислятьАмортизациюСТекущегоПериода", ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.НачислятьАмортизациюСТекущегоПериода_НМА);
	  		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Параметры.НематериальныйАктив,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Параметры.Параметр = &ПараметрНачислятьАмортизацию
	|				ТОГДА Параметры.ЗначениеПараметра
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК НачислятьАмортизацию,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Параметры.Параметр = &ПараметрНачислятьАмортизациюСТекущегоПериода
	|				ТОГДА Параметры.ЗначениеПараметра
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК НачислятьАмортизациюСТекущегоПериода
	|ПОМЕСТИТЬ ТаблицаПараметров
	|ИЗ
	|	РегистрСведений.бит_му_ПараметрыНМА.СрезПоследних(
	|			&МоментВремени,
	|			НематериальныйАктив В
	|					(ВЫБРАТЬ
	|						бит_му_НачислениеАмортизацииОСОсновныеСредства.НематериальныйАктив
	|					ИЗ
	|						Документ.бит_му_НачислениеАмортизацииНМА.НематериальныеАктивы КАК бит_му_НачислениеАмортизацииОСОсновныеСредства
	|					ГДЕ
	|						бит_му_НачислениеАмортизацииОСОсновныеСредства.Ссылка = &Ссылка)
	|				И Организация = &Организация
	|				И (Параметр = &ПараметрНачислятьАмортизацию
	|					ИЛИ Параметр = &ПараметрНачислятьАмортизациюСТекущегоПериода)) КАК Параметры
	|
	|СГРУППИРОВАТЬ ПО
	|	Параметры.НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЧасть.НомерСтроки,
	|	ТабЧасть.НематериальныйАктив КАК НематериальныйАктив,
	|	ТабЧасть.СуммаАмортизации КАК СуммаАмортизации,
	|	ТабЧасть.ПервоначальнаяСтоимость - ТабЧасть.НачисленнаяАмортизация - ТабЧасть.СуммаОбесценения - ТабЧасть.ЛиквидационнаяСтоимость - ТабЧасть.СуммаАмортизации КАК БалансоваяСтоимостьПосле,
	|	ТабЧасть.СпособОтраженияРасходовПоАмортизации,
	|	СпособыОтражения.СчетЗатрат,
	|	СпособыОтражения.Субконто1,
	|	СпособыОтражения.Субконто2,
	|	СпособыОтражения.Субконто3,
	|	СпособыОтражения.Субконто4,
	|	ЕСТЬNULL(СпособыОтражения.Коэффициент, 0) КАК Коэффициент,
	|	ТабЧасть.СчетНачисленияАмортизации,
	|	ЕСТЬNULL(ТаблицаПараметров.НачислятьАмортизацию, ЛОЖЬ) КАК НачислятьАмортизацию,
	|	ЕСТЬNULL(ТаблицаПараметров.НачислятьАмортизациюСТекущегоПериода, ЛОЖЬ) КАК НачислятьАмортизациюСТекущегоПериода,
	|	ЕСТЬNULL(СостоянияНМА.ДатаСостояния, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПринятияКУчету,
	|	ЕстьNULL(бит_Дополнительный_2ПервоначальнаяСтоимость.СуммаРеглОстатокДт, 0) - ЕстьNULL(бит_Дополнительный_2Амортизация.СуммаРеглОстатокКт, 0) - ЕстьNULL(бит_Дополнительный_2Обесценение.СуммаРеглОстатокКт, 0) КАК ОстатокАмортизацииРегл,
	|	ЕстьNULL(бит_Дополнительный_2ПервоначальнаяСтоимость.СуммаУпрОстатокДт, 0) - ЕстьNULL(бит_Дополнительный_2Амортизация.СуммаУпрОстатокКт, 0) - ЕстьNULL(бит_Дополнительный_2Обесценение.СуммаУпрОстатокКт, 0) КАК ОстатокАмортизацииУпр,
	|	ЕстьNULL(бит_Дополнительный_2ПервоначальнаяСтоимость.СуммаМУОстатокДт, 0) - ЕстьNULL(бит_Дополнительный_2Амортизация.СуммаМУОстатокКт, 0) - ЕстьNULL(бит_Дополнительный_2Обесценение.СуммаМУОстатокКт, 0) КАК ОстатокАмортизацииМУ
	|ИЗ
	|	Документ.бит_му_НачислениеАмортизацииНМА.НематериальныеАктивы КАК ТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_му_СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтражения
	|		ПО ТабЧасть.СпособОтраженияРасходовПоАмортизации = СпособыОтражения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПараметров КАК ТаблицаПараметров
	|		ПО ТабЧасть.НематериальныйАктив = ТаблицаПараметров.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СостоянияНМА КАК СостоянияНМА
	|		ПО ТабЧасть.НематериальныйАктив = СостоянияНМА.НематериальныйАктив
	|			И (СостоянияНМА.Организация = &Организация)
	|			И (СостоянияНМА.Состояние = &СостояниеПринято)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Остатки(&МоментВремени, , &МассивСубконто, Организация = &Организация И Субконто1 В (&МассивНМА)) КАК бит_Дополнительный_2Амортизация
	|		ПО ТабЧасть.НематериальныйАктив = бит_Дополнительный_2Амортизация.Субконто1
	|			И ТабЧасть.СчетНачисленияАмортизации = бит_Дополнительный_2Амортизация.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Остатки(&МоментВремени, Счет В (&МассивСчетовУчета),  &МассивСубконто, Организация = &Организация И Субконто1 В (&МассивНМА)) КАК бит_Дополнительный_2ПервоначальнаяСтоимость
	|		ПО ТабЧасть.НематериальныйАктив = бит_Дополнительный_2ПервоначальнаяСтоимость.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Остатки(&МоментВремени, Счет В (&МассивСчетовСнижения),  &МассивСубконто, Организация = &Организация И Субконто1 В (&МассивНМА)) КАК бит_Дополнительный_2Обесценение
	|		ПО ТабЧасть.НематериальныйАктив = бит_Дополнительный_2Обесценение.Субконто1
	|ГДЕ
	|	ТабЧасть.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(СуммаАмортизации),
	|	МАКСИМУМ(БалансоваяСтоимостьПосле),
	|	МАКСИМУМ(ОстатокАмортизацииРегл),
	|	МАКСИМУМ(ОстатокАмортизацииУпр),
	|	МАКСИМУМ(ОстатокАмортизацииМУ)
	|ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПараметров";
				   
	
	Результат = Запрос.Выполнить();
	
	
	СтруктураТаблиц = Новый Структура;

	СтруктураТаблиц.Вставить("НМА", Результат);
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицуБДДС()

// Процедура формирует структуру шапки документа и дополнительных полей.
// 
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ) Экспорт

	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Получим список ОС документа.
	СписокВНА = НематериальныеАктивы.ВыгрузитьКолонку("НематериальныйАктив");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(СписокВНА, Истина);
	
	СтруктураШапкиДокумента.Вставить("СписокВНА", СписокВНА);
		
	
КонецПроцедуры

// Процедура обрабатывает изменение валюты документа.
// 
Процедура ИзменениеВалютыМодуль() Экспорт

	СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
	КурсДокумента      = СтруктураКурса.Курс;
	КратностьДокумента = СтруктураКурса.Кратность;

КонецПроцедуры // ИзменениеВалютыМодуль()

// Процедура выполняет валютные пересчеты из валюты МУ в валюту документа.
// 
// Параметры:
//  ПараметрыНМА
// 
Процедура ВыполнитьВалютныеПересчетыИзВалютыМУВВалютуДокументаМодуль(ПараметрыНМА) Экспорт
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ВидыКурсов = Новый Структура("МУ, Документ");	
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	МассивСуммДляПересчета = Новый Массив;
	МассивСуммДляПересчета.Добавить("СуммаАмортизации");
	МассивСуммДляПересчета.Добавить("ПервоначальнаяСтоимость");
	МассивСуммДляПересчета.Добавить("НачисленнаяАмортизация");
	МассивСуммДляПересчета.Добавить("СуммаОбесценения");
	МассивСуммДляПересчета.Добавить("ЛиквидационнаяСтоимость");
	
	МассивНМА = Новый Массив; 
	Для каждого КлючИЗначение Из ПараметрыНМА Цикл
		МассивНМА.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	СоответствиеНМАиКурсовДокумента = бит_му_ВНА.СвязьНМАиКурсовНаДатуПринятия(МассивНМА, СтруктураКурсыВалют, Организация);
	
	Для Каждого КлючИЗначение Из ПараметрыНМА Цикл
		
		КурсыМУ 	  = СоответствиеНМАиКурсовДокумента[КлючИЗначение.Ключ].МУ;
		КурсыДокумент = СоответствиеНМАиКурсовДокумента[КлючИЗначение.Ключ].Документ;
		
		НМА = КлючИЗначение.Значение;
		
		Для каждого ИмяСуммы Из МассивСуммДляПересчета Цикл
			
			
			НМА[ИмяСуммы] = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(НМА[ИмяСуммы]
							,КурсыМУ.Валюта
							,КурсыДокумент.Валюта
							,КурсыМУ.Курс
							,КурсыДокумент.Курс
							,КурсыМУ.Кратность
							,КурсыДокумент.Кратность);
		КонецЦикла; 
		
	КонецЦикла;

	
КонецПроцедуры // ВыполнитьВалютныеПересчетыИзВалютыМУВВалютуДокументаМодуль()

// Функция получает параметры, передаваемые в обработку подбора НМА.
//
Функция ЗаполнитьПараметрыПодбора() Экспорт
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыПодбора.Вставить("Организация"		  , Организация);                             
	ПараметрыПодбора.Вставить("Режим"			  , Перечисления.бит_му_РежимыПодбораВНА.НачислениеАмортизацииНМА);
	ПараметрыПодбора.Вставить("ДатаОкончания"	  , КонецМесяца(Дата));	

	Возврат ПараметрыПодбора;
	
КонецФункции // ЗаполнитьПараметрыПодбора()

// Процедура заполняет табличную часть "НематериальныеАктивы".
// 
// Параметры:
//  ВыбранноеЗначение - Структура.
//  ЭтоНовыйДокумент  - Булево.
// 
Процедура ЗаполнитьТчНематериальныеАктивыПоДаннымПодбора(ВыбранноеЗначение, ЭтоНовыйДокумент = Истина) Экспорт
	
	ОписаниеТаблицы = ВыбранноеЗначение.Данные;
	ТаблицаДанных = бит_ОбщегоНазначения.РаспаковатьТаблицуИзМассива(ОписаниеТаблицы.ПереченьОбъектов, ОписаниеТаблицы.ПереченьОбъектов_Колонки);

	// Получаем параметры и рассчитываем амортизацию.
	МассивНМА = ТаблицаДанных.ВыгрузитьКолонку("ВНА");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивНМА);
	
	МоментВремени = ?(ЭтоНовыйДокумент, КонецДня(Дата), Ссылка.МоментВремени());
	ПараметрыНМА = бит_му_ВНА.ВыполнитьРасчетАмортизации(МассивНМА, Организация,МоментВремени,Истина);	
	
	ВыполнитьВалютныеПересчетыИзВалютыМУВВалютуДокументаМодуль(ПараметрыНМА); 
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("НематериальныйАктив", СтрокаТаблицы.ВНА);
		
		МассивСтрок = НематериальныеАктивы.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрок.Количество() = 0 Тогда
			НайденнаяСтрока = Неопределено;
		Иначе
			НайденнаяСтрока = МассивСтрок[0];
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			НоваяСтрока = НематериальныеАктивы.Добавить();
			НоваяСтрока.НематериальныйАктив = СтрокаТаблицы.ВНА;
			
			// Находим результат расчета амортизации и заполняем табличную часть.
			СтрокаПараметров = ПараметрыНМА[СтрокаТаблицы.ВНА];
			Если СтрокаПараметров <> Неопределено Тогда				
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаПараметров);				
			КонецЕсли; 
			
		Иначе
			
			ТекстСообщения = НСтр("ru = 'Нематериальный актив ""%1"" уже подобран в строке №%2.'; 
			                      |en = 'Intangible asset ""%1"" is already matched in line №%2.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.ВНА, НайденнаяСтрока.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли; 
		
	КонецЦикла; // По строкам таблицы данных			

КонецПроцедуры // ЗаполнитьТчНематериальныеАктивыПоДаннымПодбора()

// Процедура заполняет документ.
// 
// Параметры:
//  СтруктураЗаполнения - Структура.
//
Процедура ЗаполнитьДокумент(СтруктураЗаполнения) Экспорт

	// Обязательные для заполнения поля: Дата, Организация, ВидОперации
	Для каждого КлЗнч Из СтруктураЗаполнения Цикл
		ИмяРеквизита = КлЗнч.Ключ;
		Если ИмяРеквизита = "Дата" ИЛИ Метаданные().Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
			ЭтотОбъект[ИмяРеквизита] = КлЗнч.Значение;
		КонецЕсли; 	
	КонецЦикла;
	
	// Получим валюту международного учета.
	ВалютаДокумента = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация);
	ИзменениеВалютыМодуль();
	
	// Заполняет табличную часть "НематериальныеАктивы"
	ВыбранноеЗначение = ВыполнитьПодборНМА();
	ЗаполнитьТчНематериальныеАктивыПоДаннымПодбора(ВыбранноеЗначение);	

КонецПроцедуры // ЗаполнитьДокумент()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьШапкуДокумента(ОбъектКопирования = Неопределено)
	
	// Заполним шапку документа значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ОбъектКопирования);
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда		
		Дата = КонецМесяца(ТекущаяДатаСеанса());		
	Иначе		
		Дата = КонецМесяца(Дата);		
	КонецЕсли; 
	
	ВалютаДокумента = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация);
	
	СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
	КурсДокумента = СтруктураКурса.Курс;
	КратностьДокумента = СтруктураКурса.Кратность;
	
КонецПроцедуры // ЗаполнитьШапкуДокумента()

// Функция выполняет подбор ОС через обработку подбора
//
Функция ВыполнитьПодборНМА()
	
	ПараметрыПодбора  = ЗаполнитьПараметрыПодбора();
	ОбработкаПодбора  = Обработки.бит_му_ПодборВНА.Создать();
	ВыбранноеЗначение = ОбработкаПодбора.ВыполнитьПодборДляЗакрытия(ПараметрыПодбора);
	
	Возврат ВыбранноеЗначение;
	
КонецФункции // ВыполнитьПодборНМА()

//  Осуществляет поиск задвоенных начислений амортизации НМА в текущем периоде.
// 
Процедура НайтиЗадвоенныеНачисления(Отказ,Заголовок)
	
	Запрос=новый Запрос;
	запрос.УстановитьПараметр("ДатаНачала"   ,НачалоМесяца(Дата));
	запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Дата));
	запрос.УстановитьПараметр("Ссылка"       ,Ссылка);
	
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ТекДокумент.НематериальныйАктив,
	             |	ТекДокумент.Ссылка
	             |ИЗ
	             |	Документ.бит_му_НачислениеАмортизацииНМА.НематериальныеАктивы КАК ТекДокумент
	             |ГДЕ
	             |	ТекДокумент.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И ТекДокумент.Ссылка.Проведен
	             |	И ТекДокумент.Ссылка.Ссылка <> &Ссылка
	             |	И ТекДокумент.НематериальныйАктив В
	             |			(ВЫБРАТЬ
	             |				ТекДокумент.НематериальныйАктив
	             |			ИЗ
	             |				Документ.бит_му_НачислениеАмортизацииНМА.НематериальныеАктивы КАК ТекДокумент
	             |			ГДЕ
	             |				ТекДокумент.Ссылка = &Ссылка)";
				 
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.НематериальныйАктив) Тогда
			ТекстСообщения = НСтр("ru = 'По нематериальному активу № ""%1"" было проведено начисление амортизации за период: %2. Повторное начисление амортизации невозможно.'; 
			                            |en = 'For intangible asset № ""%1"", depreciation was calculated for the period: %2. Repeated depreciation is not possible.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.НематериальныйАктив, Формат(Дата,"ДФ=MMMM-YYYY"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры // бит_НайтиЗадвоенныеНачисления()

// Процедура проверяет правильность заполнения строк таблиц документа.
// 
// Параметры: 
//  СтруктураТаблиц			- Структура, таблицы значений, содержащая данные для проведения и проверки.
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
// 
Процедура ПроверитьЗаполнениеТаблицДокумента(СтруктураТаблиц, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ВыборкаОС = СтруктураТаблиц.НМА.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОС.Следующий() Цикл
	
		ВыборкаДетали = ВыборкаОС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДетали.Следующий() Цикл
			  
			  
			  Если НЕ ВыборкаДетали.НачислятьАмортизацию Тогда
				  
				  ТекстСообщения = НСтр("ru = 'По нематериальному активу ""%1"" амортизация не начисляется.'; 
				                        |en = 'For intangible asset ""%1"", depreciation is not charged.'");
				  ТекстСообщения = СтрШаблон(ТекстСообщения, ВыборкаДетали.НематериальныйАктив);				  
				  ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				  
			  КонецЕсли; 
			  
			  
			  Если ВыборкаДетали.НачислятьАмортизацию 
				  И НЕ ВыборкаДетали.НачислятьАмортизациюСТекущегоПериода
				  И КонецМесяца(ВыборкаДетали.ДатаПринятияКУчету) = КонецМесяца(СтруктураШапкиДокумента.Дата)  Тогда
				  
				  ТекстСообщения = НСтр("ru = 'По нематериальному активу ""%1"" за период %2 амортизация не начисляется.'; 
				                        |en = 'For intangible asset ""%1"" for the period %2, depreciation is not charged.'");
				  ТекстСообщения = СтрШаблон(ТекстСообщения, ВыборкаДетали.НематериальныйАктив, 
											 Формат(СтруктураШапкиДокумента.Дата,"ДФ=MMMM-YYYY"));			  
				  ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				  
			  КонецЕсли; 
			  
			  
			  // В остальных записях группировки НМА тот же - достаточно проверить первую запись группировки.
			  Прервать;
			  
		КонецЦикла; // По детальным записям
	
	КонецЦикла; // По НМА

	
КонецПроцедуры // ПроверитьЗаполнениеТаблицДокумента()

// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,СтруктураТаблиц, СтруктураКурсыВалют, ИсторическиеКурсы, Отказ, Заголовок)
	
	
	// Движения по регистру бухгалтерии бит_Дополнительный_2.
	
	ВыборкаНМА = СтруктураТаблиц.НМА.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНМА.Следующий() Цикл
		
		ВыборкаДетали = ВыборкаНМА.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// Последний месяц начисления амортизации по НМА.
		Если ВыборкаНМА.БалансоваяСтоимостьПосле <= 0 Тогда
			СуммаАмортизацииОбщая = ВыборкаНМА.ОстатокАмортизацииМУ;
			
			СуммаАмортизацииОбщаяРегл = ВыборкаНМА.ОстатокАмортизацииРегл;
			СуммаАмортизацииОбщаяУпр = ВыборкаНМА.ОстатокАмортизацииУпр;
			
			СуммаАмортизацииУпрНачисленная = 0;
			СуммаАмортизацииРеглНачисленная = 0;
		Иначе
			СуммаАмортизацииОбщая = ВыборкаНМА.СуммаАмортизации;
		КонецЕсли;
		СуммаАмортизацииНачисленная = 0;
		
		нд = 1;
		ФлагСброшен = Ложь;
		КоличествоДетали = ВыборкаДетали.Количество();
		Пока ВыборкаДетали.Следующий() Цикл
			
			// Распределяем согласно коэффициентам способа отражения расходов.
			СуммаАмортизации = Окр(СуммаАмортизацииОбщая*ВыборкаДетали.Коэффициент,2);
			СуммаАмортизацииНачисленная = СуммаАмортизацииНачисленная+СуммаАмортизации;
			
			// Убираем ошибки округления
			Если нд = КоличествоДетали Тогда
				
				СуммаАмортизации = СуммаАмортизации+СуммаАмортизацииОбщая-СуммаАмортизацииНачисленная;
				
			КонецЕсли; 
			
			// Формируем движение по начислению амортизации
			// ДТ СчетЗатрат КТ СчетНачисленияАмортизации СуммаАмортизации.
			Проводка = СоздатьЗаписьПоНачислениюАмортизации(СтруктураШапкиДокумента,ВыборкаДетали,СуммаАмортизации,ИсторическиеКурсы[ВыборкаДетали.НематериальныйАктив]);
			
			// Если полностью самортизировали НМА - будем использовать не расчетные суммы, а остатки по регистру.
			Если ВыборкаДетали.БалансоваяСтоимостьПосле <= 0
				И НЕ Проводка = Неопределено Тогда
				СуммаАмортизацииУпр = Окр(СуммаАмортизацииОбщаяУпр*ВыборкаДетали.Коэффициент,2);
				СуммаАмортизацииУпрНачисленная = СуммаАмортизацииУпрНачисленная+СуммаАмортизацииУпр;
				СуммаАмортизацииРегл = Окр(СуммаАмортизацииОбщаяРегл*ВыборкаДетали.Коэффициент,2);
				СуммаАмортизацииРеглНачисленная = СуммаАмортизацииРеглНачисленная+СуммаАмортизацииРегл;
				
				// Убираем ошибки округления
				Если нд = КоличествоДетали Тогда
					СуммаАмортизацииУпр = СуммаАмортизацииУпр+СуммаАмортизацииОбщаяУпр-СуммаАмортизацииУпрНачисленная;
					СуммаАмортизацииРегл = СуммаАмортизацииРегл+СуммаАмортизацииОбщаяРегл-СуммаАмортизацииРеглНачисленная;
				КонецЕсли;
				
				Проводка.СуммаУпр  = СуммаАмортизацииУпр;
				Проводка.СуммаРегл = СуммаАмортизацииРегл;
				
			КонецЕсли;
			
			// Если полностью самортизировали НМА - сбрасываем флаг НачислятьАмортизацию.
			Если НЕ ФлагСброшен 
				И ВыборкаДетали.БалансоваяСтоимостьПосле <=0 Тогда
				
				Запись = Движения.бит_му_ПараметрыНМА.Добавить();
				Запись.Период      = СтруктураШапкиДокумента.Дата;
				Запись.Организация = СтруктураШапкиДокумента.Организация;
				Запись.НематериальныйАктив = ВыборкаДетали.НематериальныйАктив;
				Запись.Параметр            = ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.НачислятьАмортизацию_НМА;
				Запись.ЗначениеПараметра   = Ложь;
				ФлагСброшен                = Истина;
				
			КонецЕсли; 
			
			нд = нд+1;
			
			КонецЦикла; // По детальным записям
			
			// По регистру события НМА
			Запись = Движения.бит_му_СобытияНМА.Добавить();
			Запись.Период              = СтруктураШапкиДокумента.Дата;
			Запись.Организация         = СтруктураШапкиДокумента.Организация;
			Запись.НематериальныйАктив = ВыборкаНМА.НематериальныйАктив;
			Запись.Событие             = Перечисления.бит_му_СобытияНМА.НачислениеАмортизации;
			
		КонецЦикла; // По ОС
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Процедура формирует проводку по списанию амортизации НМА.
// 
// Параметры:
//  СтруктураШапкиДокумента  - Структура.
//  СтрокаТаблицы            - СтрокаТаблицыЗначений.
//  ВалютаМУ                 - СправочникСсылка.Валюты.
//  СтруктураКурсыВалют      - Структура.
//                
Функция СоздатьЗаписьПоНачислениюАмортизации(СтруктураШапкиДокумента,СтрокаТаблицы,Сумма,СтруктураКурсыВалют)

	Если Сумма = 0 Тогда
	
		Возврат Неопределено;
	
	КонецЕсли; 

	Запись = Движения.бит_Дополнительный_2.Добавить();
	// Заполнение атрибутов записи	
	СодержаниеПроводки = НСтр("ru='начислена амортизация';en='depreciation accrued'");
						 
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	СтруктураПараметров.Вставить("Период",      СтруктураШапкиДокумента.Дата);
	СтруктураПараметров.Вставить("Валюта",      СтруктураКурсыВалют.Документ.Валюта);
	СтруктураПараметров.Вставить("СчетДт",      СтрокаТаблицы.СчетЗатрат);
	СтруктураПараметров.Вставить("СчетКт",      СтрокаТаблицы.СчетНачисленияАмортизации);
	СтруктураПараметров.Вставить("Сумма",       Сумма);
	СтруктураПараметров.Вставить("Содержание",  СодержаниеПроводки);
											   
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись,СтруктураПараметров);											   
	
	// Заполнение аналитики	
	
	Для ном = 1 По мКоличествоСубконтоМУ Цикл
		
		бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт,Запись.СубконтоДт,ном,СтрокаТаблицы["Субконто"+ном]);			
		
	КонецЦикла; 
	
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт
	                                            ,Запись.СубконтоКт
												,"НематериальныеАктивы"
												,СтрокаТаблицы.НематериальныйАктив);		
	
	
	// Выполнение валютных пересчетов	
	МассивИмен = Новый Массив;
	МассивИмен.Добавить("Сумма");
	бит_КурсыВалют.ВыполнитьВалютныеПересчеты(СтруктураПараметров
													,Запись
													,МассивИмен
													,СтруктураКурсыВалют
													,СтруктураКурсыВалют.Документ);

	Возврат Запись;
	
КонецФункции // СоздатьЗаписьПоСписаниюАмортизации()

Функция ИсторическиеКурсыВалют(СтруктураШапкиДокумента, МассивНМА, Период, СтруктураКурсыВалют)
	
	ИсторическиеКурсы = бит_му_ВНА.ИсторическиеКурсыВалют(СтруктураШапкиДокумента, МассивНМА, Период, СтруктураКурсыВалют);	
	
	СоответствиеНМАиКурсовДокумента = бит_му_ВНА.СвязьНМАиКурсовНаДатуПринятия(МассивНМА, СтруктураКурсыВалют.Документ, Организация);
		
	Для Каждого ТекНМА Из ИсторическиеКурсы Цикл
		ТекНМА.Значение.Документ = СоответствиеНМАиКурсовДокумента[ТекНМА.Ключ].Документ;
	КонецЦикла;
	
	Возврат ИсторическиеКурсы;
	
КонецФункции

#КонецОбласти

#Область Инициализация

мКоличествоСубконтоМУ = 4;

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
